InformationRegisters/СвязиКонтрагентКонтакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентКонтакт</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязьНедействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭПДляПоиска</Name>
					<Comment>Адрес ЭП для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаДляПоиска</Name>
					<Comment>Номер телефона для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРолей</Name>
					<Comment>Для представления в списках</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИнтеграцияShareУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ИнтеграцияShareПереопределяемый.КонтактныеЛицаСНомеромТелефона
Процедура КонтактныеЛицаСНомеромТелефона(Знач Контрагент, КонтактнаяИнформация) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СвязиКонтрагентКонтактСрезПоследних.Контакт КАК Контакт
	|ПОМЕСТИТЬ ВТКонтакты
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(
	|			,
	|			Контрагент = &Контрагент
	|				И СвязьНедействительна = ЛОЖЬ) КАК СвязиКонтрагентКонтактСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтактныеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	ВТКонтакты КАК ВТКонтакты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	|		ПО ВТКонтакты.Контакт = КонтактныеЛицаКонтактнаяИнформация.Ссылка
	|			И (НЕ КонтактныеЛицаКонтактнаяИнформация.Ссылка.ПометкаУдаления)
	|			И (КонтактныеЛицаКонтактнаяИнформация.Тип = &Тип)
	|			И (КонтактныеЛицаКонтактнаяИнформация.Вид = &ВидКонтактаКонтактногоЛица)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрагентыКонтактнаяИнформация.Ссылка,
	|	КонтрагентыКонтактнаяИнформация.НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.Тип = &Тип
	|	И КонтрагентыКонтактнаяИнформация.Вид = &ВидКонтактаКонтрагента
	|	И НЕ КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления"; 	
	
	ТипКонтакта						= Перечисления.ТипыКонтактнойИнформации.Телефон;
	ВидКонтактаКонтактногоЛица		= Справочники.ВидыКонтактнойИнформации["ТелефонКонтактногоЛица"].Ссылка;
    ВидКонтактаКонтрагента 			= Справочники.ВидыКонтактнойИнформации["ТелефонКонтрагента"].Ссылка;
	
	Запрос.УстановитьПараметр("Контрагент"					, Контрагент);
	Запрос.УстановитьПараметр("Тип"							, ТипКонтакта);
	Запрос.УстановитьПараметр("ВидКонтактаКонтактногоЛица"	, ВидКонтактаКонтактногоЛица);
	Запрос.УстановитьПараметр("ВидКонтактаКонтрагента"		, ВидКонтактаКонтрагента);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Контакт = ИнтеграцияShareКлиентСервер.НовыйКонтактнаяИнформация();
		Контакт.ВладелецКонтакта      = Выборка.Ссылка;
		Контакт.НомерТелефонаБезКодов = БезКодаСтраныРФ(Выборка.НомерТелефона);;
		КонтактнаяИнформация.Добавить(Контакт);
	КонецЦикла;
	
КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииСоставаКомандShare
Процедура ПриОпределенииСоставаКомандShare(СоставКоманд) Экспорт

	СоставКоманд.Входящие.Добавить(Метаданные.Документы.ЗаказПокупателя.ПолноеИмя()); 
	СоставКоманд.Входящие.Добавить(Метаданные.Документы.ЗаказПоставщику.ПолноеИмя());
	СоставКоманд.Входящие.Добавить(Метаданные.Документы.СчетНаОплатуПоставщика.ПолноеИмя());

КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ЗаполнитьНастройкиФормированияДокумента
Процедура ЗаполнитьНастройкиФормированияДокумента(СсылкаНаДокумент, НастройкиФормирования) Экспорт
			
	ПоддерживаемыеФорматыЭДО = ФорматыЭДО.ПоддерживаемыеФорматы();
	ТипыДокументов           = ОбменСКонтрагентами.ТипыДокументов();
	НаправленияДокументов    = ОбменСКонтрагентами.НаправленияДокументов();
	
	ТипИсточника = ТипЗнч(СсылкаНаДокумент);

	Если ТипИсточника = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Реквизиты = "Организация, Контрагент, Договор";
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, Реквизиты);
		
		НастройкиФормирования.ТипДокумента       = ТипыДокументов.ОтветНаЗаказ;
		НастройкиФормирования.Формат             = ПоддерживаемыеФорматыЭДО.CML208;
		НастройкиФормирования.Направление        = НаправленияДокументов.Исходящий;
		НастройкиФормирования.Организация        = СсылкаНаДокумент.Организация;
		НастройкиФормирования.Контрагент         = СсылкаНаДокумент.Контрагент;
		НастройкиФормирования.ДоговорКонтрагента = ЗначенияРеквизитов.Договор;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		Реквизиты = "Организация, Контрагент, Договор";
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, Реквизиты);
		
		НастройкиФормирования.ТипДокумента       = ТипыДокументов.СчетНаОплату;
		НастройкиФормирования.Формат             = ПоддерживаемыеФорматыЭДО.CML208;
		НастройкиФормирования.Направление        = НаправленияДокументов.Исходящий;
		НастройкиФормирования.Организация        = ЗначенияРеквизитов.Организация;
		НастройкиФормирования.Контрагент         = ЗначенияРеквизитов.Контрагент;
		НастройкиФормирования.ДоговорКонтрагента = ЗначенияРеквизитов.Договор;

	КонецЕсли;

КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииВизуализацииПубликуемогоДокумента
Процедура ПриОпределенииВизуализацииПубликуемогоДокумента(ОписаниеПредставленияДокумента,
	Знач ПараметрыПубликуемогоДокументаДляВизуализации, СтандартнаяОбработка) Экспорт 
	
	СтандартнаяОбработка = Ложь; 
	ОписаниеПредставленияДокумента = Новый Структура;
	ОписаниеПредставленияДокумента.Вставить("ИмяФайла", "");
	ОписаниеПредставленияДокумента.Вставить("ДвоичныеДанные", Неопределено);
		
	ОбъектУчета = ПараметрыПубликуемогоДокументаДляВизуализации.ОбъектУчета;
	
	ИмяМакета = "";
	Если ТипЗнч(ОбъектУчета) = Тип("ДокументСсылка.ЗаказПокупателя") 
		ИЛИ ТипЗнч(ОбъектУчета) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		ИмяМакета = "СчетНаОплату";
	КонецЕсли;
	
	Если ТипЗнч(ОбъектУчета) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		КомандыПечати = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.ЗаказПокупателя); 
	ИначеЕсли ТипЗнч(ОбъектУчета) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		КомандыПечати = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.СчетНаОплату);
	КонецЕсли;
	
	КомандаСчетНаОплату = КомандыПечати.Найти("СчетНаОплату");
	КомандыПечати = Новый Массив;
	КомандыПечати.Добавить(КомандаСчетНаОплату);
	
	ОбъектыДляПечати = Новый Массив; 
	ОбъектыДляПечати.Добавить(ПараметрыПубликуемогоДокументаДляВизуализации.ОбъектУчета);
	
	НастройкиСохранения = УправлениеПечатью.НастройкиСохранения();
	НастройкиСохранения.ПодписьИПечать = ПечатьДокументовУНФ.НастройкаПользователяЗаполнятьФаксимиле(ИмяМакета);
	
	ДанныеПФ = УправлениеПечатью.НапечататьВФайл(КомандыПечати, ОбъектыДляПечати, НастройкиСохранения);
	Если ДанныеПФ.Количество() Тогда
		ОписаниеПредставленияДокумента.ДвоичныеДанные = ДанныеПФ[0].ДвоичныеДанные; 
		ОписаниеПредставленияДокумента.ИмяФайла = ДанныеПФ[0].ИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Если ИнтеграцияShare.ЕстьПравоИспользованияСервиса() Тогда
		
		Команда								= Команды.Добавить();
		Команда.Вид							= "Отправить";
		Команда.Идентификатор				= "ПоделитьсяДокументомShare";
		Команда.Представление				= НСтр("ru = 'Поделиться документом'", ОбщегоНазначения.КодОсновногоЯзыка());
		Команда.Важность					= "Обычное";
		Команда.Порядок						= 101;
		Команда.ОтображениеКнопки			= ОтображениеКнопки.Картинка;
		Команда.Картинка					= БиблиотекаКартинок["Поделиться"];
		Команда.ТипПараметра				= ПолучитьТипыОбъектовShare();
		Команда.ИзменяетВыбранныеОбъекты	= Ложь;
		Команда.РежимЗаписи					= "Записывать";
		Команда.Обработчик					= "ИнтеграцияShareКлиент.ПоделитьсяДокументом";
		Команда.МножественныйВыбор 			= Ложь;
		Команда.ТолькоВоВсехДействиях		= Ложь;  
	
	КонецЕсли;

КонецПроцедуры  

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииДанныхПубликуемогоДокумента
Процедура ПриОпределенииДанныхПубликуемогоДокумента(ДанныеТранспортногоКонтейнера, Знач СсылкаНаДокумент) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуЗакупки") Тогда
		
		ПолныйПуть = "КарточкаПередаваемыхДанных.НастройкиПубликации.СхемаПубликации";
		Результат = ДанныеТранспортногоКонтейнера.Строки.Найти(ПолныйПуть, "ПолныйПуть", Истина);
		Если Результат <> Неопределено Тогда
			Результат.Значение = "ТолькоПубликация";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТипыОбъектовShare() Экспорт

	ТипыОбъектов = Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя, ДокументСсылка.СчетНаОплату");

	Возврат ТипыОбъектов

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция БезКодаСтраныРФ(Знач НомерТелефона)
	
	Если СтрДлина(НомерТелефона) > 0 И СтрНачинаетсяС(НомерТелефона, "7") Тогда
		НомерТелефона = Сред(НомерТелефона, 2);
	КонецЕсли;
	
	Возврат НомерТелефона;
	
КонецФункции

#КонецОбласти
